Autodesk.Revit.DB.IFC.IFCLevelInfo.Create(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Double,System.Double,System.Double,System.Boolean)
Creates an IFCLevelInfo.
buildingStorey:
The building storey handle (IfcBuildingStorey).
localPlacement:
The local placement handle (IfcLocalPlacement).
height:
The height of the level.
elevation:
The elevation of the level.
scaleFactor:
The scale factor.
isPrimaryLevel:
True if this is primary level, false otherwise.
Returns:
The IFCLevelInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013